//на собеседованииc
// const someObj = Object.create(null);//обьект без прототипа, применятеся для например списка
// чтобы например при вызове не существ. метода он не ссылался на не нужную функцию, далее по наследованию



// конструктор с прототипом
// function Car () {
//     this.state = 'stoped';
// }
// Car.prototype.run = function () {
//     this.state = 'running';
// };

// const someCar = new Car();
// console.log(someCar);
// someCar.run();
// способы задания прототипов

// встроенные объекты, полифилы

// защищенные свойства

// наследование свойств не из прототипа
