// Выведется ли alert? почему?
// if (" ") {
//     alert( 'Привет' );
// }

// Используя конструкцию if..else, напишите код, который получает число через prompt, а затем выводит в alert
// если число меньше 12 вывелите сообщение "Доброе утро!"
// если число равно 12 выведите сообщение "Пора обедать!"
// если число больше 12 выведите сообщение "Добрый день!"


// перепешите if в тернарный оператор "?:"
let result;

// if (a + b < 4) {
//   result = 'Мало';
// } else {
//   result = 'Много';
// }
