// что выведет код
// alert( null || 2 || undefined ); // 2
// alert( 1 && null && 2 ); // null
// alert( null || 2 && 3 || 4 ); // 3

// alert(1 && 2 && 3 && 1 && 0 && 5 )

alert(0 || 1 || 2);


// Напишите условие if для проверки, что переменная age находится в диапазоне между 14 и 90 включительно.
// «Включительно» означает, что значение переменной age может быть равно 14 или 90.

// Напишите условие if для проверки, что значение переменной age НЕ находится в диапазоне 14 и 90 включительно.
// Напишите два варианта: первый с использованием оператора НЕ !, второй – без этого оператора.